[M_EternalFlame MissionDefinition]
MissionDescription="The vampire asks you to worship this ethnic group as a goddess.. Lamia can be beautiful, terrifying, or both. He asked me to find out if there was any evil planned in the tribe.. In order to become a cult member, you must speak with the cult leader, Clayton.."

[M_EternalFlame:Collect5BanditAshesSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="Lilith asks you to join the tribe of dancers who worship her as a goddess.. Clayton, the leader of the Sherpa tribe, ordered some of his friends to be burned alive at the stake and the ashes collected.. When you do, you become an official burn member.."

[M_LightingTheMatch MissionDefinition]
TurnInDescription="Shearsen climbed into Firehawk's warm arms, hoping for a happily ever after..<br><br>Or is it hell?."

[M_TheEnkindling MissionDefinition]
MissionDescription="Lilith is determined not to abuse the Firehawk children. But he wants you to read the whole "review" before you give up meditation completely.."
